### Description:
Этот проект представляет собой веб-приложение, которое реализует функцию создания и прохождения опросов.
Опросы создаются для конкретной группы людей, причём, 1 человек может проголосовать не более 1 раза.

### System scope:
Пользователь может создавать новые опросы и приглашать в них участников. После завершения опроса всем участникам и создателю приходят результаты.
Пройдя опрос 1 раз, человек больше не имеет к нему доступ.
Неприглашенные к опросу пользователи не имеют к нему доступа.
После завершения опрос удаляется, просматривать старые опросы нельзя.
Опросы полностью анонимные, ни в какой момент времени нельзя узнать, кто за что голосовал.

### Advantages:
Наш проект будет успешным и востребованным благодаря следующим преимуществам:
Один человек сможет проголосовать в 1 опросе не более одного раза
В опросе не будет “лишних” участников - голосуют только те, кого указал создатель опроса
Голосование проходит быстро для участника опроса.
